Documents/ВСД2_Инвентаризация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ВСД2_Инвентаризация</Name>
			<Comment>api 2.*</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.кб99_ОстаткиПартийВСД</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Владелец_ХозСубъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_ХозСубъект</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Владелец_Площадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_Площадка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>Документ-основание</Comment>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаРасхождения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеНесоответствия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Продукция</Name>
					<Comment>Можно фасовку добавить</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВСД_Партия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Продукция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВСД_Продукция</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПродукции</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВСД_ВидПродукции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеПродукции</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Продукция_Элемент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВСД_Продукция_Элемент</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВСД_ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Скоропортящийся</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Некачественный</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаИзготовления1</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаИзготовления2</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаСрокГодности1</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаСрокГодности2</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Производитель_площадка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВСД_Площадка</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Производитель_Страна</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВСД_Страна</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФасовкаФормаУпаковки</Name>
							<Comment>Тип упаковки</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ВСД_ФормыУпаковки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФасовкаКоличество</Name>
							<Comment>Количество единиц упаковки</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФасовкаОбъем</Name>
							<Comment>Объем единицы упаковки товара</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФасовкаЕдиницаИзмерения</Name>
							<Comment>Единица измерения объёма единицы упаковки товара</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ВСД_ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоДоИзменения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоРазница</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УровниУпаковки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтрокаПродукции</Name>
							<Comment>Связь с таблицей Продукция</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерУровня</Name>
							<Type>
								<v8:Type>cfg:EnumRef.кб99_УровниУпаковки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормаУпаковки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВСД_ФормыУпаковки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Маркировка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерУровня</Name>
							<Type>
								<v8:Type>cfg:EnumRef.кб99_УровниУпаковки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Класс</Name>
							<Type>
								<v8:Type>cfg:EnumRef.кб99_Маркировка</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Маркировка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаПродукции</Name>
							<Comment>Связь с таблицей Продукция</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПартииРезультат</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВСД_Партия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДокументыОснования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументОснования</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ВСД2_Инвентаризация/Ext/ObjectModule.bsl
// GRACE:MODULE_START name="ИнвентаризацияВСД"
// @grace-module: ИнвентаризацияВСД
// @grace-purpose: Объектный модуль документа ВСД2_Инвентаризация — заполнение строк продукции из партий или данных расхождений
// @grace-depends: ИнвентаризацияВСД, ЯдроВСД, ИнтеграцияВетИС_API, РегистрыПартий
// @grace-version: 1.0
// @grace-contract-ref: docs/Contracts.xml -> module="ИнвентаризацияВСД"
// GRACE:DEPENDENCY target="кб99_ВСД"
// GRACE:DEPENDENCY target="ВетИС_APIСервер"
// GRACE:DEPENDENCY target="ВетИС_УтилитыКлиентСервер"

Процедура ЗаполнитьРеквизитыСтроки(СтрокаТЧ)
	
	Если ЗначениеЗаполнено(СтрокаТЧ.Партия) Тогда
		ЗаполнитьЗначенияСвойств( СтрокаТЧ, СтрокаТЧ.Партия );
		СтрокаТЧ.КоличествоДоИзменения = СтрокаТЧ.Партия.Количество;
		СтрокаТЧ.КоличествоРазница = СтрокаТЧ.Количество - СтрокаТЧ.КоличествоДоИзменения;
		СтрокаТЧ.ДатаСрокГодности1 = ВетИС_APIСервер.СтрокаВДатаВремя( СтрокаТЧ.Партия.ДатаСрокГодности1 );
		СтрокаТЧ.ДатаИзготовления1 = ВетИС_APIСервер.СтрокаВДатаВремя( СтрокаТЧ.Партия.ДатаИзготовления1 );
		СтрокаТЧ.ДатаСрокГодности2 = ВетИС_APIСервер.СтрокаВДатаВремя( СтрокаТЧ.Партия.ДатаСрокГодности2 );
		СтрокаТЧ.ДатаИзготовления2 = ВетИС_APIСервер.СтрокаВДатаВремя( СтрокаТЧ.Партия.ДатаИзготовления2 );
	Иначе
		ЗаполнитьЗначенияСвойств( СтрокаТЧ, СтрокаТЧ.Продукция_Элемент);
		СтрокаТЧ.Производитель_Площадка = СтрокаТЧ.Продукция_Элемент.Площадка;
		СтрокаТЧ.НаименованиеПродукции = СтрокаТЧ.Продукция_Элемент.Наименование;
	КонецЕсли;
	Если ЗначениеЗаполнено(СтрокаТЧ.Производитель_Площадка) Тогда
		СтрокаТЧ.Производитель_Страна = СтрокаТЧ.Производитель_Площадка.Страна;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если (ТипЗнч(ДанныеЗаполнения) = Тип("ТаблицаЗначений")) Тогда 
		
		ПараметрыОрганизации = ВетИС_ЯдроСервер.ЗагрузитьПараметры( Организация );
		
		Для Каждого СтрПартии Из ДанныеЗаполнения Цикл
			Если СтрПартии.Количество >= СтрПартии.КоличествоСписания Тогда
				Продолжить;
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(СтрПартии.Продукция_Элемент)  Тогда
				Продолжить;
			КонецЕсли;
			
			Разница = СтрПартии.КоличествоСписания - СтрПартии.Количество;
			НоваяСтрока = Продукция.Добавить();
			НоваяСтрока.КлючСтроки = Новый УникальныйИдентификатор();
			НоваяСтрока.Продукция_Элемент 	= СтрПартии.Продукция_Элемент;
			НоваяСтрока.Количество 			= Разница;
			НоваяСтрока.КоличествоРазница	= Разница;
			НоваяСтрока.Продукция 			= НоваяСтрока.Продукция_Элемент.Продукция;
			НоваяСтрока.ВидПродукции 		= НоваяСтрока.Продукция_Элемент.ВидПродукции;
			НоваяСтрока.ЕдиницаИзмерения 	= НоваяСтрока.Продукция_Элемент.ЕдиницаИзмерения;
			Если Не ЗначениеЗаполнено( НоваяСтрока.ЕдиницаИзмерения ) Тогда 
				ВетИС_ЯдроСервер.СообщитьИнфо("Не заполнена ЕдиницаИзмерения в "+НоваяСтрока.Продукция_Элемент);	
			КонецЕсли;
			НоваяСтрока.НаименованиеПродукции = НоваяСтрока.Продукция_Элемент.Наименование;
			НоваяСтрока.ДатаИзготовления1 = Дата;
			НоваяСтрока.ДатаСрокГодности1 = Дата + НоваяСтрока.Продукция_Элемент.СрокГодности*86400;
			НоваяСтрока.Производитель_площадка = ?(ЗначениеЗаполнено(НоваяСтрока.Продукция_Элемент.Площадка),
				НоваяСтрока.Продукция_Элемент.Площадка,
				Владелец_Площадка);
			НоваяСтрока.Производитель_Страна = ?(ЗначениеЗаполнено(НоваяСтрока.Производитель_площадка.Страна), 
				НоваяСтрока.Производитель_площадка.Страна,
				ПараметрыОрганизации["Страна"]);
		КонецЦикла;
	ИначеЕсли ( ТипЗнч(ДанныеЗаполнения) = Тип("Структура") ) Тогда 
		ЭтотОбъект.Организация = ДанныеЗаполнения.ПараметрыДокумента.Организация;
		ЭтотОбъект.Владелец_Площадка = ДанныеЗаполнения.ПараметрыДокумента.Отправитель_Площадка;
		ЭтотОбъект.Владелец_ХозСубъект   =   ДанныеЗаполнения.ПараметрыДокумента.Отправитель_ХозСубъект;
		ЭтотОбъект.ПричинаРасхождения    =   ДанныеЗаполнения.ПараметрыДокумента.парамПричинаРасхождения;
		ЭтотОбъект.ОписаниеНесоответствия =  ДанныеЗаполнения.ПараметрыДокумента.парамОписаниеНесоответствия;
		Если ДанныеЗаполнения.Свойство("Партии") Тогда 
			Для Каждого стрПартия из ДанныеЗаполнения.Партии Цикл
				СтрТовары = ЭтотОбъект.Продукция.Добавить();
				СтрТовары.КлючСтроки = Новый УникальныйИдентификатор();
				ЗаполнитьЗначенияСвойств( стрТовары, стрПартия );
				ЗаполнитьРеквизитыСтроки(СтрТовары);
			КонецЦикла;
		ИначеЕсли ДанныеЗаполнения.Свойство("РаспределеннаяПродукция") Тогда
			ЭтотОбъект.ОписаниеНесоответствия =  "Распределение продукции, принятой со склада временного хранения";
			Для Каждого стрПродукция из ДанныеЗаполнения.РаспределеннаяПродукция Цикл
				СтрТовары = ЭтотОбъект.Продукция.Добавить();
				ЗаполнитьЗначенияСвойств(стрТовары, стрПродукция);
				
				Если ВетИС_УтилитыКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(стрПродукция, "ДатаИзготовления") Тогда
					СтрТовары.ДатаИзготовления1 = ВетИС_APIСервер.СтрокаВДатаВремя(стрПродукция.ДатаИзготовления);	
				КонецЕсли;
				
				Если ВетИС_УтилитыКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(стрПродукция, "ДатаСрокГодности") Тогда
					СтрТовары.ДатаСрокГодности1 = ВетИС_APIСервер.СтрокаВДатаВремя(стрПродукция.ДатаСрокГодности);	
				КонецЕсли;

				СтрТовары.КлючСтроки = Новый УникальныйИдентификатор();
				ЗаполнитьРеквизитыСтроки(СтрТовары);
				СтрТовары.Продукция_Элемент = стрПродукция.Продукция_Элемент;
				Если ЗначениеЗаполнено(стрПродукция.КоличествоСписания) Тогда
					СтрТовары.Количество = стрПродукция.Количество - стрПродукция.КоличествоСписания;
				КонецЕсли;
				Если ЗначениеЗаполнено(стрПродукция.НомерУровняУпаковки) Тогда
					// Уровни и форма упаковки.
					СтрУпаковки = ЭтотОбъект.УровниУпаковки.Добавить();
					СтрУпаковки.СтрокаПродукции = СтрТовары.КлючСтроки;
					СтрУпаковки.НомерУровня = стрПродукция.НомерУровняУпаковки;
					СтрУпаковки.ФормаУпаковки = ?(ЗначениеЗаполнено(стрПродукция.ФормаУпаковки),стрПродукция.ФормаУпаковки,Неопределено);
					СтрУпаковки.Количество = ?(ЗначениеЗаполнено(стрПродукция.КоличествоУпаковок),стрПродукция.КоличествоУпаковок,1);
					// Маркировка
					СтрМаркировка = ЭтотОбъект.Маркировка.Добавить();
					СтрМаркировка.Класс = Перечисления.кб99_Маркировка.UNDEFINED;
					СтрМаркировка.Маркировка = ?(ЗначениеЗаполнено(СтрТовары.Продукция_Элемент.Площадка),СтрТовары.Производитель_площадка.Наименование,ЭтотОбъект.Владелец_ХозСубъект.Наименование);
					СтрМаркировка.НомерУровня = СтрУпаковки.НомерУровня;
					СтрМаркировка.СтрокаПродукции = СтрУпаковки.СтрокаПродукции;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Если ВетИС_ГашениеСервер.ФормироватьДвиженияПартий(Организация) Тогда
		
		Движения.кб99_ОстаткиПартийВСД.Записывать = Истина;
			
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВСД2_ИнвентаризацияПродукция.Продукция_Элемент КАК Продукция_Элемент,
			|	СУММА(ВСД2_ИнвентаризацияПродукция.Количество - ВСД2_ИнвентаризацияПродукция.КоличествоДоИзменения) КАК КоличествоДвижения
			|ИЗ
			|	Документ.ВСД2_Инвентаризация.Продукция КАК ВСД2_ИнвентаризацияПродукция
			|ГДЕ
			|	ВСД2_ИнвентаризацияПродукция.Ссылка.Ссылка = &Ссылка
			|
			|СГРУППИРОВАТЬ ПО
			|	ВСД2_ИнвентаризацияПродукция.Продукция_Элемент";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Если ВыборкаДетальныеЗаписи.КоличествоДвижения = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Движение = Движения.кб99_ОстаткиПартийВСД.Добавить();
			Если ВыборкаДетальныеЗаписи.КоличествоДвижения > 0 Тогда
				КоличествоДвижения = ВыборкаДетальныеЗаписи.КоличествоДвижения;
				ВидДвижения = ВидДвиженияНакопления.Приход;
			Иначе
				КоличествоДвижения = -ВыборкаДетальныеЗаписи.КоличествоДвижения;
				ВидДвижения = ВидДвиженияНакопления.Расход;
			КонецЕсли;
			Движение.ВидДвижения = ВидДвижения;
			Движение.Период = Дата;
			Движение.ВСД_Площадка = Владелец_Площадка;
			Движение.Продукция_Элемент = ВыборкаДетальныеЗаписи.Продукция_Элемент;
			Движение.Количество = КоличествоДвижения;

		КонецЦикла;

	КонецЕсли;

КонецПроцедуры
// GRACE:MODULE_END name="ИнвентаризацияВСД"
